ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_gpio.h
/***************************************************************************//**
* \file cyip_gpio.h
*
* \brief
* GPIO IP definitions
*
* \note
* Generated 2/9/2017 by CyDeviceHeaderGenerator v1.1.0.47
* from the register map configuration rev#961378
*
********************************************************************************
* \copyright
* Copyright 2016-2017, Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#ifndef _CYIP_GPIO_H_
#define _CYIP_GPIO_H_

#include "cyip_headers.h"

/* =========================================================================================================================== */
/* ================                                           GPIO                                            ================ */
/* =========================================================================================================================== */

#define GPIO_PRT_SECTION_SIZE       0x00000080UL
#define GPIO_SECTION_SIZE           0x00010000UL

/**
  * \brief GPIO port registers (GPIO_PRT)
  */
typedef struct {
  __IOM uint32_t OUT;                           /*!< 0x00000000 Port output data register                                      */
  __IOM uint32_t OUT_CLR;                       /*!< 0x00000004 Port output data set register                                  */
  __IOM uint32_t OUT_SET;                       /*!< 0x00000008 Port output data clear register                                */
  __IOM uint32_t OUT_INV;                       /*!< 0x0000000C Port output data invert register                               */
   __IM uint32_t IN;                            /*!< 0x00000010 Port input state register                                      */
  __IOM uint32_t INTR;                          /*!< 0x00000014 Port interrupt status register                                 */
  __IOM uint32_t INTR_MASK;                     /*!< 0x00000018 Port interrupt mask register                                   */
   __IM uint32_t INTR_MASKED;                   /*!< 0x0000001C Port interrupt masked status register                          */
  __IOM uint32_t INTR_SET;                      /*!< 0x00000020 Port interrupt set register                                    */
  __IOM uint32_t INTR_CFG;                      /*!< 0x00000024 Port interrupt configuration register                          */
  __IOM uint32_t CFG;                           /*!< 0x00000028 Port configuration register                                    */
  __IOM uint32_t CFG_IN;                        /*!< 0x0000002C Port input buffer configuration register                       */
  __IOM uint32_t CFG_OUT;                       /*!< 0x00000030 Port output buffer configuration register                      */
  __IOM uint32_t CFG_SIO;                       /*!< 0x00000034 Port SIO configuration register                                */
   __IM uint32_t RESERVED;
  __IOM uint32_t CFG_IN_GPIO5V;                 /*!< 0x0000003C Port GPIO5V input buffer configuration register                */
   __IM uint32_t RESERVED1[16];
} GPIO_PRT_Type;                                /*!< Size = 64 (0x40)                                                          */

/**
  * \brief GPIO port control/configuration (GPIO)
  */
typedef struct {                                /*!< GPIO Structure                                                            */
        GPIO_PRT_Type PRT[128];                 /*!< 0x00000000 GPIO port registers                                            */
   __IM uint32_t INTR_CAUSE0;                   /*!< 0x00004000 Interrupt port cause register 0                                */
   __IM uint32_t INTR_CAUSE1;                   /*!< 0x00004004 Interrupt port cause register 1                                */
   __IM uint32_t INTR_CAUSE2;                   /*!< 0x00004008 Interrupt port cause register 2                                */
   __IM uint32_t INTR_CAUSE3;                   /*!< 0x0000400C Interrupt port cause register 3                                */
   __IM uint32_t VDD_ACTIVE;                    /*!< 0x00004010 Extern power supply detection register                         */
  __IOM uint32_t VDD_INTR;                      /*!< 0x00004014 Supply detection interrupt register                            */
  __IOM uint32_t VDD_INTR_MASK;                 /*!< 0x00004018 Supply detection interrupt mask register                       */
   __IM uint32_t VDD_INTR_MASKED;               /*!< 0x0000401C Supply detection interrupt masked register                     */
  __IOM uint32_t VDD_INTR_SET;                  /*!< 0x00004020 Supply detection interrupt set register                        */
} GPIO_Type;                                    /*!< Size = 16420 (0x4024)                                                     */


/* =====================================================  GPIO_PRT.OUT  ====================================================== */
#define GPIO_PRT_OUT_OUT0_Pos             (0UL)                 /*!< GPIO_PRT OUT: OUT0 (Bit 0)                                */
#define GPIO_PRT_OUT_OUT0_Msk             (0x1UL)               /*!< GPIO_PRT OUT: OUT0 (Bitfield-Mask: 0x01)                  */
#define GPIO_PRT_OUT_OUT1_Pos             (1UL)                 /*!< GPIO_PRT OUT: OUT1 (Bit 1)                                */
#define GPIO_PRT_OUT_OUT1_Msk             (0x2UL)               /*!< GPIO_PRT OUT: OUT1 (Bitfield-Mask: 0x01)                  */
#define GPIO_PRT_OUT_OUT2_Pos             (2UL)                 /*!< GPIO_PRT OUT: OUT2 (Bit 2)                                */
#define GPIO_PRT_OUT_OUT2_Msk             (0x4UL)               /*!< GPIO_PRT OUT: OUT2 (Bitfield-Mask: 0x01)                  */
#define GPIO_PRT_OUT_OUT3_Pos             (3UL)                 /*!< GPIO_PRT OUT: OUT3 (Bit 3)                                */
#define GPIO_PRT_OUT_OUT3_Msk             (0x8UL)               /*!< GPIO_PRT OUT: OUT3 (Bitfield-Mask: 0x01)                  */
#define GPIO_PRT_OUT_OUT4_Pos             (4UL)                 /*!< GPIO_PRT OUT: OUT4 (Bit 4)                                */
#define GPIO_PRT_OUT_OUT4_Msk             (0x10UL)              /*!< GPIO_PRT OUT: OUT4 (Bitfield-Mask: 0x01)                  */
#define GPIO_PRT_OUT_OUT5_Pos             (5UL)                 /*!< GPIO_PRT OUT: OUT5 (Bit 5)                                */
#define GPIO_PRT_OUT_OUT5_Msk             (0x20UL)              /*!< GPIO_PRT OUT: OUT5 (Bitfield-Mask: 0x01)                  */
#define GPIO_PRT_OUT_OUT6_Pos             (6UL)                 /*!< GPIO_PRT OUT: OUT6 (Bit 6)                                */
#define GPIO_PRT_OUT_OUT6_Msk             (0x40UL)              /*!< GPIO_PRT OUT: OUT6 (Bitfield-Mask: 0x01)                  */
#define GPIO_PRT_OUT_OUT7_Pos             (7UL)                 /*!< GPIO_PRT OUT: OUT7 (Bit 7)                                */
#define GPIO_PRT_OUT_OUT7_Msk             (0x80UL)              /*!< GPIO_PRT OUT: OUT7 (Bitfield-Mask: 0x01)                  */
/* ===================================================  GPIO_PRT.OUT_CLR  ==================================================== */
#define GPIO_PRT_OUT_CLR_OUT0_Pos         (0UL)                 /*!< GPIO_PRT OUT_CLR: OUT0 (Bit 0)                            */
#define GPIO_PRT_OUT_CLR_OUT0_Msk         (0x1UL)               /*!< GPIO_PRT OUT_CLR: OUT0 (Bitfield-Mask: 0x01)              */
#define GPIO_PRT_OUT_CLR_OUT1_Pos         (1UL)                 /*!< GPIO_PRT OUT_CLR: OUT1 (Bit 1)                            */
#define GPIO_PRT_OUT_CLR_OUT1_Msk         (0x2UL)               /*!< GPIO_PRT OUT_CLR: OUT1 (Bitfield-Mask: 0x01)              */
#define GPIO_PRT_OUT_CLR_OUT2_Pos         (2UL)                 /*!< GPIO_PRT OUT_CLR: OUT2 (Bit 2)                            */
#define GPIO_PRT_OUT_CLR_OUT2_Msk         (0x4UL)               /*!< GPIO_PRT OUT_CLR: OUT2 (Bitfield-Mask: 0x01)              */
#define GPIO_PRT_OUT_CLR_OUT3_Pos         (3UL)                 /*!< GPIO_PRT OUT_CLR: OUT3 (Bit 3)                            */
#define GPIO_PRT_OUT_CLR_OUT3_Msk         (0x8UL)               /*!< GPIO_PRT OUT_CLR: OUT3 (Bitfield-Mask: 0x01)              */
#define GPIO_PRT_OUT_CLR_OUT4_Pos         (4UL)                 /*!< GPIO_PRT OUT_CLR: OUT4 (Bit 4)                            */
#define GPIO_PRT_OUT_CLR_OUT4_Msk         (0x10UL)              /*!< GPIO_PRT OUT_CLR: OUT4 (Bitfield-Mask: 0x01)              */
#define GPIO_PRT_OUT_CLR_OUT5_Pos         (5UL)                 /*!< GPIO_PRT OUT_CLR: OUT5 (Bit 5)                            */
#define GPIO_PRT_OUT_CLR_OUT5_Msk         (0x20UL)              /*!< GPIO_PRT OUT_CLR: OUT5 (Bitfield-Mask: 0x01)              */
#define GPIO_PRT_OUT_CLR_OUT6_Pos         (6UL)                 /*!< GPIO_PRT OUT_CLR: OUT6 (Bit 6)                            */
#define GPIO_PRT_OUT_CLR_OUT6_Msk         (0x40UL)              /*!< GPIO_PRT OUT_CLR: OUT6 (Bitfield-Mask: 0x01)              */
#define GPIO_PRT_OUT_CLR_OUT7_Pos         (7UL)                 /*!< GPIO_PRT OUT_CLR: OUT7 (Bit 7)                            */
#define GPIO_PRT_OUT_CLR_OUT7_Msk         (0x80UL)              /*!< GPIO_PRT OUT_CLR: OUT7 (Bitfield-Mask: 0x01)              */
/* ===================================================  GPIO_PRT.OUT_SET  ==================================================== */
#define GPIO_PRT_OUT_SET_OUT0_Pos         (0UL)                 /*!< GPIO_PRT OUT_SET: OUT0 (Bit 0)                            */
#define GPIO_PRT_OUT_SET_OUT0_Msk         (0x1UL)               /*!< GPIO_PRT OUT_SET: OUT0 (Bitfield-Mask: 0x01)              */
#define GPIO_PRT_OUT_SET_OUT1_Pos         (1UL)                 /*!< GPIO_PRT OUT_SET: OUT1 (Bit 1)                            */
#define GPIO_PRT_OUT_SET_OUT1_Msk         (0x2UL)               /*!< GPIO_PRT OUT_SET: OUT1 (Bitfield-Mask: 0x01)              */
#define GPIO_PRT_OUT_SET_OUT2_Pos         (2UL)                 /*!< GPIO_PRT OUT_SET: OUT2 (Bit 2)                            */
#define GPIO_PRT_OUT_SET_OUT2_Msk         (0x4UL)               /*!< GPIO_PRT OUT_SET: OUT2 (Bitfield-Mask: 0x01)              */
#define GPIO_PRT_OUT_SET_OUT3_Pos         (3UL)                 /*!< GPIO_PRT OUT_SET: OUT3 (Bit 3)                            */
#define GPIO_PRT_OUT_SET_OUT3_Msk         (0x8UL)               /*!< GPIO_PRT OUT_SET: OUT3 (Bitfield-Mask: 0x01)              */
#define GPIO_PRT_OUT_SET_OUT4_Pos         (4UL)                 /*!< GPIO_PRT OUT_SET: OUT4 (Bit 4)                            */
#define GPIO_PRT_OUT_SET_OUT4_Msk         (0x10UL)              /*!< GPIO_PRT OUT_SET: OUT4 (Bitfield-Mask: 0x01)              */
#define GPIO_PRT_OUT_SET_OUT5_Pos         (5UL)                 /*!< GPIO_PRT OUT_SET: OUT5 (Bit 5)                            */
#define GPIO_PRT_OUT_SET_OUT5_Msk         (0x20UL)              /*!< GPIO_PRT OUT_SET: OUT5 (Bitfield-Mask: 0x01)              */
#define GPIO_PRT_OUT_SET_OUT6_Pos         (6UL)                 /*!< GPIO_PRT OUT_SET: OUT6 (Bit 6)                            */
#define GPIO_PRT_OUT_SET_OUT6_Msk         (0x40UL)              /*!< GPIO_PRT OUT_SET: OUT6 (Bitfield-Mask: 0x01)              */
#define GPIO_PRT_OUT_SET_OUT7_Pos         (7UL)                 /*!< GPIO_PRT OUT_SET: OUT7 (Bit 7)                            */
#define GPIO_PRT_OUT_SET_OUT7_Msk         (0x80UL)              /*!< GPIO_PRT OUT_SET: OUT7 (Bitfield-Mask: 0x01)              */
/* ===================================================  GPIO_PRT.OUT_INV  ==================================================== */
#define GPIO_PRT_OUT_INV_OUT0_Pos         (0UL)                 /*!< GPIO_PRT OUT_INV: OUT0 (Bit 0)                            */
#define GPIO_PRT_OUT_INV_OUT0_Msk         (0x1UL)               /*!< GPIO_PRT OUT_INV: OUT0 (Bitfield-Mask: 0x01)              */
#define GPIO_PRT_OUT_INV_OUT1_Pos         (1UL)                 /*!< GPIO_PRT OUT_INV: OUT1 (Bit 1)                            */
#define GPIO_PRT_OUT_INV_OUT1_Msk         (0x2UL)               /*!< GPIO_PRT OUT_INV: OUT1 (Bitfield-Mask: 0x01)              */
#define GPIO_PRT_OUT_INV_OUT2_Pos         (2UL)                 /*!< GPIO_PRT OUT_INV: OUT2 (Bit 2)                            */
#define GPIO_PRT_OUT_INV_OUT2_Msk         (0x4UL)               /*!< GPIO_PRT OUT_INV: OUT2 (Bitfield-Mask: 0x01)              */
#define GPIO_PRT_OUT_INV_OUT3_Pos         (3UL)                 /*!< GPIO_PRT OUT_INV: OUT3 (Bit 3)                            */
#define GPIO_PRT_OUT_INV_OUT3_Msk         (0x8UL)               /*!< GPIO_PRT OUT_INV: OUT3 (Bitfield-Mask: 0x01)              */
#define GPIO_PRT_OUT_INV_OUT4_Pos         (4UL)                 /*!< GPIO_PRT OUT_INV: OUT4 (Bit 4)                            */
#define GPIO_PRT_OUT_INV_OUT4_Msk         (0x10UL)              /*!< GPIO_PRT OUT_INV: OUT4 (Bitfield-Mask: 0x01)              */
#define GPIO_PRT_OUT_INV_OUT5_Pos         (5UL)                 /*!< GPIO_PRT OUT_INV: OUT5 (Bit 5)                            */
#define GPIO_PRT_OUT_INV_OUT5_Msk         (0x20UL)              /*!< GPIO_PRT OUT_INV: OUT5 (Bitfield-Mask: 0x01)              */
#define GPIO_PRT_OUT_INV_OUT6_Pos         (6UL)                 /*!< GPIO_PRT OUT_INV: OUT6 (Bit 6)                            */
#define GPIO_PRT_OUT_INV_OUT6_Msk         (0x40UL)              /*!< GPIO_PRT OUT_INV: OUT6 (Bitfield-Mask: 0x01)              */
#define GPIO_PRT_OUT_INV_OUT7_Pos         (7UL)                 /*!< GPIO_PRT OUT_INV: OUT7 (Bit 7)                            */
#define GPIO_PRT_OUT_INV_OUT7_Msk         (0x80UL)              /*!< GPIO_PRT OUT_INV: OUT7 (Bitfield-Mask: 0x01)              */
/* ======================================================  GPIO_PRT.IN  ====================================================== */
#define GPIO_PRT_IN_IN0_Pos               (0UL)                 /*!< GPIO_PRT IN: IN0 (Bit 0)                                  */
#define GPIO_PRT_IN_IN0_Msk               (0x1UL)               /*!< GPIO_PRT IN: IN0 (Bitfield-Mask: 0x01)                    */
#define GPIO_PRT_IN_IN1_Pos               (1UL)                 /*!< GPIO_PRT IN: IN1 (Bit 1)                                  */
#define GPIO_PRT_IN_IN1_Msk               (0x2UL)               /*!< GPIO_PRT IN: IN1 (Bitfield-Mask: 0x01)                    */
#define GPIO_PRT_IN_IN2_Pos               (2UL)                 /*!< GPIO_PRT IN: IN2 (Bit 2)                                  */
#define GPIO_PRT_IN_IN2_Msk               (0x4UL)               /*!< GPIO_PRT IN: IN2 (Bitfield-Mask: 0x01)                    */
#define GPIO_PRT_IN_IN3_Pos               (3UL)                 /*!< GPIO_PRT IN: IN3 (Bit 3)                                  */
#define GPIO_PRT_IN_IN3_Msk               (0x8UL)               /*!< GPIO_PRT IN: IN3 (Bitfield-Mask: 0x01)                    */
#define GPIO_PRT_IN_IN4_Pos               (4UL)                 /*!< GPIO_PRT IN: IN4 (Bit 4)                                  */
#define GPIO_PRT_IN_IN4_Msk               (0x10UL)              /*!< GPIO_PRT IN: IN4 (Bitfield-Mask: 0x01)                    */
#define GPIO_PRT_IN_IN5_Pos               (5UL)                 /*!< GPIO_PRT IN: IN5 (Bit 5)                                  */
#define GPIO_PRT_IN_IN5_Msk               (0x20UL)              /*!< GPIO_PRT IN: IN5 (Bitfield-Mask: 0x01)                    */
#define GPIO_PRT_IN_IN6_Pos               (6UL)                 /*!< GPIO_PRT IN: IN6 (Bit 6)                                  */
#define GPIO_PRT_IN_IN6_Msk               (0x40UL)              /*!< GPIO_PRT IN: IN6 (Bitfield-Mask: 0x01)                    */
#define GPIO_PRT_IN_IN7_Pos               (7UL)                 /*!< GPIO_PRT IN: IN7 (Bit 7)                                  */
#define GPIO_PRT_IN_IN7_Msk               (0x80UL)              /*!< GPIO_PRT IN: IN7 (Bitfield-Mask: 0x01)                    */
#define GPIO_PRT_IN_FLT_IN_Pos            (8UL)                 /*!< GPIO_PRT IN: FLT_IN (Bit 8)                               */
#define GPIO_PRT_IN_FLT_IN_Msk            (0x100UL)             /*!< GPIO_PRT IN: FLT_IN (Bitfield-Mask: 0x01)                 */
/* =====================================================  GPIO_PRT.INTR  ===================================================== */
#define GPIO_PRT_INTR_EDGE0_Pos           (0UL)                 /*!< GPIO_PRT INTR: EDGE0 (Bit 0)                              */
#define GPIO_PRT_INTR_EDGE0_Msk           (0x1UL)               /*!< GPIO_PRT INTR: EDGE0 (Bitfield-Mask: 0x01)                */
#define GPIO_PRT_INTR_EDGE1_Pos           (1UL)                 /*!< GPIO_PRT INTR: EDGE1 (Bit 1)                              */
#define GPIO_PRT_INTR_EDGE1_Msk           (0x2UL)               /*!< GPIO_PRT INTR: EDGE1 (Bitfield-Mask: 0x01)                */
#define GPIO_PRT_INTR_EDGE2_Pos           (2UL)                 /*!< GPIO_PRT INTR: EDGE2 (Bit 2)                              */
#define GPIO_PRT_INTR_EDGE2_Msk           (0x4UL)               /*!< GPIO_PRT INTR: EDGE2 (Bitfield-Mask: 0x01)                */
#define GPIO_PRT_INTR_EDGE3_Pos           (3UL)                 /*!< GPIO_PRT INTR: EDGE3 (Bit 3)                              */
#define GPIO_PRT_INTR_EDGE3_Msk           (0x8UL)               /*!< GPIO_PRT INTR: EDGE3 (Bitfield-Mask: 0x01)                */
#define GPIO_PRT_INTR_EDGE4_Pos           (4UL)                 /*!< GPIO_PRT INTR: EDGE4 (Bit 4)                              */
#define GPIO_PRT_INTR_EDGE4_Msk           (0x10UL)              /*!< GPIO_PRT INTR: EDGE4 (Bitfield-Mask: 0x01)                */
#define GPIO_PRT_INTR_EDGE5_Pos           (5UL)                 /*!< GPIO_PRT INTR: EDGE5 (Bit 5)                              */
#define GPIO_PRT_INTR_EDGE5_Msk           (0x20UL)              /*!< GPIO_PRT INTR: EDGE5 (Bitfield-Mask: 0x01)                */
#define GPIO_PRT_INTR_EDGE6_Pos           (6UL)                 /*!< GPIO_PRT INTR: EDGE6 (Bit 6)                              */
#define GPIO_PRT_INTR_EDGE6_Msk           (0x40UL)              /*!< GPIO_PRT INTR: EDGE6 (Bitfield-Mask: 0x01)                */
#define GPIO_PRT_INTR_EDGE7_Pos           (7UL)                 /*!< GPIO_PRT INTR: EDGE7 (Bit 7)                              */
#define GPIO_PRT_INTR_EDGE7_Msk           (0x80UL)              /*!< GPIO_PRT INTR: EDGE7 (Bitfield-Mask: 0x01)                */
#define GPIO_PRT_INTR_FLT_EDGE_Pos        (8UL)                 /*!< GPIO_PRT INTR: FLT_EDGE (Bit 8)                           */
#define GPIO_PRT_INTR_FLT_EDGE_Msk        (0x100UL)             /*!< GPIO_PRT INTR: FLT_EDGE (Bitfield-Mask: 0x01)             */
#define GPIO_PRT_INTR_IN_IN0_Pos          (16UL)                /*!< GPIO_PRT INTR: IN_IN0 (Bit 16)                            */
#define GPIO_PRT_INTR_IN_IN0_Msk          (0x10000UL)           /*!< GPIO_PRT INTR: IN_IN0 (Bitfield-Mask: 0x01)               */
#define GPIO_PRT_INTR_IN_IN1_Pos          (17UL)                /*!< GPIO_PRT INTR: IN_IN1 (Bit 17)                            */
#define GPIO_PRT_INTR_IN_IN1_Msk          (0x20000UL)           /*!< GPIO_PRT INTR: IN_IN1 (Bitfield-Mask: 0x01)               */
#define GPIO_PRT_INTR_IN_IN2_Pos          (18UL)                /*!< GPIO_PRT INTR: IN_IN2 (Bit 18)                            */
#define GPIO_PRT_INTR_IN_IN2_Msk          (0x40000UL)           /*!< GPIO_PRT INTR: IN_IN2 (Bitfield-Mask: 0x01)               */
#define GPIO_PRT_INTR_IN_IN3_Pos          (19UL)                /*!< GPIO_PRT INTR: IN_IN3 (Bit 19)                            */
#define GPIO_PRT_INTR_IN_IN3_Msk          (0x80000UL)           /*!< GPIO_PRT INTR: IN_IN3 (Bitfield-Mask: 0x01)               */
#define GPIO_PRT_INTR_IN_IN4_Pos          (20UL)                /*!< GPIO_PRT INTR: IN_IN4 (Bit 20)                            */
#define GPIO_PRT_INTR_IN_IN4_Msk          (0x100000UL)          /*!< GPIO_PRT INTR: IN_IN4 (Bitfield-Mask: 0x01)               */
#define GPIO_PRT_INTR_IN_IN5_Pos          (21UL)                /*!< GPIO_PRT INTR: IN_IN5 (Bit 21)                            */
#define GPIO_PRT_INTR_IN_IN5_Msk          (0x200000UL)          /*!< GPIO_PRT INTR: IN_IN5 (Bitfield-Mask: 0x01)               */
#define GPIO_PRT_INTR_IN_IN6_Pos          (22UL)                /*!< GPIO_PRT INTR: IN_IN6 (Bit 22)                            */
#define GPIO_PRT_INTR_IN_IN6_Msk          (0x400000UL)          /*!< GPIO_PRT INTR: IN_IN6 (Bitfield-Mask: 0x01)               */
#define GPIO_PRT_INTR_IN_IN7_Pos          (23UL)                /*!< GPIO_PRT INTR: IN_IN7 (Bit 23)                            */
#define GPIO_PRT_INTR_IN_IN7_Msk          (0x800000UL)          /*!< GPIO_PRT INTR: IN_IN7 (Bitfield-Mask: 0x01)               */
#define GPIO_PRT_INTR_FLT_IN_IN_Pos       (24UL)                /*!< GPIO_PRT INTR: FLT_IN_IN (Bit 24)                         */
#define GPIO_PRT_INTR_FLT_IN_IN_Msk       (0x1000000UL)         /*!< GPIO_PRT INTR: FLT_IN_IN (Bitfield-Mask: 0x01)            */
/* ==================================================  GPIO_PRT.INTR_MASK  =================================================== */
#define GPIO_PRT_INTR_MASK_EDGE0_Pos      (0UL)                 /*!< GPIO_PRT INTR_MASK: EDGE0 (Bit 0)                         */
#define GPIO_PRT_INTR_MASK_EDGE0_Msk      (0x1UL)               /*!< GPIO_PRT INTR_MASK: EDGE0 (Bitfield-Mask: 0x01)           */
#define GPIO_PRT_INTR_MASK_EDGE1_Pos      (1UL)                 /*!< GPIO_PRT INTR_MASK: EDGE1 (Bit 1)                         */
#define GPIO_PRT_INTR_MASK_EDGE1_Msk      (0x2UL)               /*!< GPIO_PRT INTR_MASK: EDGE1 (Bitfield-Mask: 0x01)           */
#define GPIO_PRT_INTR_MASK_EDGE2_Pos      (2UL)                 /*!< GPIO_PRT INTR_MASK: EDGE2 (Bit 2)                         */
#define GPIO_PRT_INTR_MASK_EDGE2_Msk      (0x4UL)               /*!< GPIO_PRT INTR_MASK: EDGE2 (Bitfield-Mask: 0x01)           */
#define GPIO_PRT_INTR_MASK_EDGE3_Pos      (3UL)                 /*!< GPIO_PRT INTR_MASK: EDGE3 (Bit 3)                         */
#define GPIO_PRT_INTR_MASK_EDGE3_Msk      (0x8UL)               /*!< GPIO_PRT INTR_MASK: EDGE3 (Bitfield-Mask: 0x01)           */
#define GPIO_PRT_INTR_MASK_EDGE4_Pos      (4UL)                 /*!< GPIO_PRT INTR_MASK: EDGE4 (Bit 4)                         */
#define GPIO_PRT_INTR_MASK_EDGE4_Msk      (0x10UL)              /*!< GPIO_PRT INTR_MASK: EDGE4 (Bitfield-Mask: 0x01)           */
#define GPIO_PRT_INTR_MASK_EDGE5_Pos      (5UL)                 /*!< GPIO_PRT INTR_MASK: EDGE5 (Bit 5)                         */
#define GPIO_PRT_INTR_MASK_EDGE5_Msk      (0x20UL)              /*!< GPIO_PRT INTR_MASK: EDGE5 (Bitfield-Mask: 0x01)           */
#define GPIO_PRT_INTR_MASK_EDGE6_Pos      (6UL)                 /*!< GPIO_PRT INTR_MASK: EDGE6 (Bit 6)                         */
#define GPIO_PRT_INTR_MASK_EDGE6_Msk      (0x40UL)              /*!< GPIO_PRT INTR_MASK: EDGE6 (Bitfield-Mask: 0x01)           */
#define GPIO_PRT_INTR_MASK_EDGE7_Pos      (7UL)                 /*!< GPIO_PRT INTR_MASK: EDGE7 (Bit 7)                         */
#define GPIO_PRT_INTR_MASK_EDGE7_Msk      (0x80UL)              /*!< GPIO_PRT INTR_MASK: EDGE7 (Bitfield-Mask: 0x01)           */
#define GPIO_PRT_INTR_MASK_FLT_EDGE_Pos   (8UL)                 /*!< GPIO_PRT INTR_MASK: FLT_EDGE (Bit 8)                      */
#define GPIO_PRT_INTR_MASK_FLT_EDGE_Msk   (0x100UL)             /*!< GPIO_PRT INTR_MASK: FLT_EDGE (Bitfield-Mask: 0x01)        */
/* =================================================  GPIO_PRT.INTR_MASKED  ================================================== */
#define GPIO_PRT_INTR_MASKED_EDGE0_Pos    (0UL)                 /*!< GPIO_PRT INTR_MASKED: EDGE0 (Bit 0)                       */
