ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_gpio.h
#define GPIO_PRT_INTR_MASKED_EDGE0_Msk    (0x1UL)               /*!< GPIO_PRT INTR_MASKED: EDGE0 (Bitfield-Mask: 0x01)         */
#define GPIO_PRT_INTR_MASKED_EDGE1_Pos    (1UL)                 /*!< GPIO_PRT INTR_MASKED: EDGE1 (Bit 1)                       */
#define GPIO_PRT_INTR_MASKED_EDGE1_Msk    (0x2UL)               /*!< GPIO_PRT INTR_MASKED: EDGE1 (Bitfield-Mask: 0x01)         */
#define GPIO_PRT_INTR_MASKED_EDGE2_Pos    (2UL)                 /*!< GPIO_PRT INTR_MASKED: EDGE2 (Bit 2)                       */
#define GPIO_PRT_INTR_MASKED_EDGE2_Msk    (0x4UL)               /*!< GPIO_PRT INTR_MASKED: EDGE2 (Bitfield-Mask: 0x01)         */
#define GPIO_PRT_INTR_MASKED_EDGE3_Pos    (3UL)                 /*!< GPIO_PRT INTR_MASKED: EDGE3 (Bit 3)                       */
#define GPIO_PRT_INTR_MASKED_EDGE3_Msk    (0x8UL)               /*!< GPIO_PRT INTR_MASKED: EDGE3 (Bitfield-Mask: 0x01)         */
#define GPIO_PRT_INTR_MASKED_EDGE4_Pos    (4UL)                 /*!< GPIO_PRT INTR_MASKED: EDGE4 (Bit 4)                       */
#define GPIO_PRT_INTR_MASKED_EDGE4_Msk    (0x10UL)              /*!< GPIO_PRT INTR_MASKED: EDGE4 (Bitfield-Mask: 0x01)         */
#define GPIO_PRT_INTR_MASKED_EDGE5_Pos    (5UL)                 /*!< GPIO_PRT INTR_MASKED: EDGE5 (Bit 5)                       */
#define GPIO_PRT_INTR_MASKED_EDGE5_Msk    (0x20UL)              /*!< GPIO_PRT INTR_MASKED: EDGE5 (Bitfield-Mask: 0x01)         */
#define GPIO_PRT_INTR_MASKED_EDGE6_Pos    (6UL)                 /*!< GPIO_PRT INTR_MASKED: EDGE6 (Bit 6)                       */
#define GPIO_PRT_INTR_MASKED_EDGE6_Msk    (0x40UL)              /*!< GPIO_PRT INTR_MASKED: EDGE6 (Bitfield-Mask: 0x01)         */
#define GPIO_PRT_INTR_MASKED_EDGE7_Pos    (7UL)                 /*!< GPIO_PRT INTR_MASKED: EDGE7 (Bit 7)                       */
#define GPIO_PRT_INTR_MASKED_EDGE7_Msk    (0x80UL)              /*!< GPIO_PRT INTR_MASKED: EDGE7 (Bitfield-Mask: 0x01)         */
#define GPIO_PRT_INTR_MASKED_FLT_EDGE_Pos (8UL)                 /*!< GPIO_PRT INTR_MASKED: FLT_EDGE (Bit 8)                    */
#define GPIO_PRT_INTR_MASKED_FLT_EDGE_Msk (0x100UL)             /*!< GPIO_PRT INTR_MASKED: FLT_EDGE (Bitfield-Mask: 0x01)      */
/* ===================================================  GPIO_PRT.INTR_SET  =================================================== */
#define GPIO_PRT_INTR_SET_EDGE0_Pos       (0UL)                 /*!< GPIO_PRT INTR_SET: EDGE0 (Bit 0)                          */
#define GPIO_PRT_INTR_SET_EDGE0_Msk       (0x1UL)               /*!< GPIO_PRT INTR_SET: EDGE0 (Bitfield-Mask: 0x01)            */
#define GPIO_PRT_INTR_SET_EDGE1_Pos       (1UL)                 /*!< GPIO_PRT INTR_SET: EDGE1 (Bit 1)                          */
#define GPIO_PRT_INTR_SET_EDGE1_Msk       (0x2UL)               /*!< GPIO_PRT INTR_SET: EDGE1 (Bitfield-Mask: 0x01)            */
#define GPIO_PRT_INTR_SET_EDGE2_Pos       (2UL)                 /*!< GPIO_PRT INTR_SET: EDGE2 (Bit 2)                          */
#define GPIO_PRT_INTR_SET_EDGE2_Msk       (0x4UL)               /*!< GPIO_PRT INTR_SET: EDGE2 (Bitfield-Mask: 0x01)            */
#define GPIO_PRT_INTR_SET_EDGE3_Pos       (3UL)                 /*!< GPIO_PRT INTR_SET: EDGE3 (Bit 3)                          */
#define GPIO_PRT_INTR_SET_EDGE3_Msk       (0x8UL)               /*!< GPIO_PRT INTR_SET: EDGE3 (Bitfield-Mask: 0x01)            */
#define GPIO_PRT_INTR_SET_EDGE4_Pos       (4UL)                 /*!< GPIO_PRT INTR_SET: EDGE4 (Bit 4)                          */
#define GPIO_PRT_INTR_SET_EDGE4_Msk       (0x10UL)              /*!< GPIO_PRT INTR_SET: EDGE4 (Bitfield-Mask: 0x01)            */
#define GPIO_PRT_INTR_SET_EDGE5_Pos       (5UL)                 /*!< GPIO_PRT INTR_SET: EDGE5 (Bit 5)                          */
#define GPIO_PRT_INTR_SET_EDGE5_Msk       (0x20UL)              /*!< GPIO_PRT INTR_SET: EDGE5 (Bitfield-Mask: 0x01)            */
#define GPIO_PRT_INTR_SET_EDGE6_Pos       (6UL)                 /*!< GPIO_PRT INTR_SET: EDGE6 (Bit 6)                          */
#define GPIO_PRT_INTR_SET_EDGE6_Msk       (0x40UL)              /*!< GPIO_PRT INTR_SET: EDGE6 (Bitfield-Mask: 0x01)            */
#define GPIO_PRT_INTR_SET_EDGE7_Pos       (7UL)                 /*!< GPIO_PRT INTR_SET: EDGE7 (Bit 7)                          */
#define GPIO_PRT_INTR_SET_EDGE7_Msk       (0x80UL)              /*!< GPIO_PRT INTR_SET: EDGE7 (Bitfield-Mask: 0x01)            */
#define GPIO_PRT_INTR_SET_FLT_EDGE_Pos    (8UL)                 /*!< GPIO_PRT INTR_SET: FLT_EDGE (Bit 8)                       */
#define GPIO_PRT_INTR_SET_FLT_EDGE_Msk    (0x100UL)             /*!< GPIO_PRT INTR_SET: FLT_EDGE (Bitfield-Mask: 0x01)         */
/* ===================================================  GPIO_PRT.INTR_CFG  =================================================== */
#define GPIO_PRT_INTR_CFG_EDGE0_SEL_Pos   (0UL)                 /*!< GPIO_PRT INTR_CFG: EDGE0_SEL (Bit 0)                      */
#define GPIO_PRT_INTR_CFG_EDGE0_SEL_Msk   (0x3UL)               /*!< GPIO_PRT INTR_CFG: EDGE0_SEL (Bitfield-Mask: 0x03)        */
#define GPIO_PRT_INTR_CFG_EDGE1_SEL_Pos   (2UL)                 /*!< GPIO_PRT INTR_CFG: EDGE1_SEL (Bit 2)                      */
#define GPIO_PRT_INTR_CFG_EDGE1_SEL_Msk   (0xcUL)               /*!< GPIO_PRT INTR_CFG: EDGE1_SEL (Bitfield-Mask: 0x03)        */
#define GPIO_PRT_INTR_CFG_EDGE2_SEL_Pos   (4UL)                 /*!< GPIO_PRT INTR_CFG: EDGE2_SEL (Bit 4)                      */
#define GPIO_PRT_INTR_CFG_EDGE2_SEL_Msk   (0x30UL)              /*!< GPIO_PRT INTR_CFG: EDGE2_SEL (Bitfield-Mask: 0x03)        */
#define GPIO_PRT_INTR_CFG_EDGE3_SEL_Pos   (6UL)                 /*!< GPIO_PRT INTR_CFG: EDGE3_SEL (Bit 6)                      */
#define GPIO_PRT_INTR_CFG_EDGE3_SEL_Msk   (0xc0UL)              /*!< GPIO_PRT INTR_CFG: EDGE3_SEL (Bitfield-Mask: 0x03)        */
#define GPIO_PRT_INTR_CFG_EDGE4_SEL_Pos   (8UL)                 /*!< GPIO_PRT INTR_CFG: EDGE4_SEL (Bit 8)                      */
#define GPIO_PRT_INTR_CFG_EDGE4_SEL_Msk   (0x300UL)             /*!< GPIO_PRT INTR_CFG: EDGE4_SEL (Bitfield-Mask: 0x03)        */
#define GPIO_PRT_INTR_CFG_EDGE5_SEL_Pos   (10UL)                /*!< GPIO_PRT INTR_CFG: EDGE5_SEL (Bit 10)                     */
#define GPIO_PRT_INTR_CFG_EDGE5_SEL_Msk   (0xc00UL)             /*!< GPIO_PRT INTR_CFG: EDGE5_SEL (Bitfield-Mask: 0x03)        */
#define GPIO_PRT_INTR_CFG_EDGE6_SEL_Pos   (12UL)                /*!< GPIO_PRT INTR_CFG: EDGE6_SEL (Bit 12)                     */
#define GPIO_PRT_INTR_CFG_EDGE6_SEL_Msk   (0x3000UL)            /*!< GPIO_PRT INTR_CFG: EDGE6_SEL (Bitfield-Mask: 0x03)        */
#define GPIO_PRT_INTR_CFG_EDGE7_SEL_Pos   (14UL)                /*!< GPIO_PRT INTR_CFG: EDGE7_SEL (Bit 14)                     */
#define GPIO_PRT_INTR_CFG_EDGE7_SEL_Msk   (0xc000UL)            /*!< GPIO_PRT INTR_CFG: EDGE7_SEL (Bitfield-Mask: 0x03)        */
#define GPIO_PRT_INTR_CFG_FLT_EDGE_SEL_Pos (16UL)               /*!< GPIO_PRT INTR_CFG: FLT_EDGE_SEL (Bit 16)                  */
#define GPIO_PRT_INTR_CFG_FLT_EDGE_SEL_Msk (0x30000UL)          /*!< GPIO_PRT INTR_CFG: FLT_EDGE_SEL (Bitfield-Mask: 0x03)     */
#define GPIO_PRT_INTR_CFG_FLT_SEL_Pos     (18UL)                /*!< GPIO_PRT INTR_CFG: FLT_SEL (Bit 18)                       */
#define GPIO_PRT_INTR_CFG_FLT_SEL_Msk     (0x1c0000UL)          /*!< GPIO_PRT INTR_CFG: FLT_SEL (Bitfield-Mask: 0x07)          */
/* =====================================================  GPIO_PRT.CFG  ====================================================== */
#define GPIO_PRT_CFG_DRIVE_MODE0_Pos      (0UL)                 /*!< GPIO_PRT CFG: DRIVE_MODE0 (Bit 0)                         */
#define GPIO_PRT_CFG_DRIVE_MODE0_Msk      (0x7UL)               /*!< GPIO_PRT CFG: DRIVE_MODE0 (Bitfield-Mask: 0x07)           */
#define GPIO_PRT_CFG_IN_EN0_Pos           (3UL)                 /*!< GPIO_PRT CFG: IN_EN0 (Bit 3)                              */
#define GPIO_PRT_CFG_IN_EN0_Msk           (0x8UL)               /*!< GPIO_PRT CFG: IN_EN0 (Bitfield-Mask: 0x01)                */
#define GPIO_PRT_CFG_DRIVE_MODE1_Pos      (4UL)                 /*!< GPIO_PRT CFG: DRIVE_MODE1 (Bit 4)                         */
#define GPIO_PRT_CFG_DRIVE_MODE1_Msk      (0x70UL)              /*!< GPIO_PRT CFG: DRIVE_MODE1 (Bitfield-Mask: 0x07)           */
#define GPIO_PRT_CFG_IN_EN1_Pos           (7UL)                 /*!< GPIO_PRT CFG: IN_EN1 (Bit 7)                              */
#define GPIO_PRT_CFG_IN_EN1_Msk           (0x80UL)              /*!< GPIO_PRT CFG: IN_EN1 (Bitfield-Mask: 0x01)                */
#define GPIO_PRT_CFG_DRIVE_MODE2_Pos      (8UL)                 /*!< GPIO_PRT CFG: DRIVE_MODE2 (Bit 8)                         */
#define GPIO_PRT_CFG_DRIVE_MODE2_Msk      (0x700UL)             /*!< GPIO_PRT CFG: DRIVE_MODE2 (Bitfield-Mask: 0x07)           */
#define GPIO_PRT_CFG_IN_EN2_Pos           (11UL)                /*!< GPIO_PRT CFG: IN_EN2 (Bit 11)                             */
#define GPIO_PRT_CFG_IN_EN2_Msk           (0x800UL)             /*!< GPIO_PRT CFG: IN_EN2 (Bitfield-Mask: 0x01)                */
#define GPIO_PRT_CFG_DRIVE_MODE3_Pos      (12UL)                /*!< GPIO_PRT CFG: DRIVE_MODE3 (Bit 12)                        */
#define GPIO_PRT_CFG_DRIVE_MODE3_Msk      (0x7000UL)            /*!< GPIO_PRT CFG: DRIVE_MODE3 (Bitfield-Mask: 0x07)           */
#define GPIO_PRT_CFG_IN_EN3_Pos           (15UL)                /*!< GPIO_PRT CFG: IN_EN3 (Bit 15)                             */
#define GPIO_PRT_CFG_IN_EN3_Msk           (0x8000UL)            /*!< GPIO_PRT CFG: IN_EN3 (Bitfield-Mask: 0x01)                */
#define GPIO_PRT_CFG_DRIVE_MODE4_Pos      (16UL)                /*!< GPIO_PRT CFG: DRIVE_MODE4 (Bit 16)                        */
#define GPIO_PRT_CFG_DRIVE_MODE4_Msk      (0x70000UL)           /*!< GPIO_PRT CFG: DRIVE_MODE4 (Bitfield-Mask: 0x07)           */
#define GPIO_PRT_CFG_IN_EN4_Pos           (19UL)                /*!< GPIO_PRT CFG: IN_EN4 (Bit 19)                             */
#define GPIO_PRT_CFG_IN_EN4_Msk           (0x80000UL)           /*!< GPIO_PRT CFG: IN_EN4 (Bitfield-Mask: 0x01)                */
#define GPIO_PRT_CFG_DRIVE_MODE5_Pos      (20UL)                /*!< GPIO_PRT CFG: DRIVE_MODE5 (Bit 20)                        */
#define GPIO_PRT_CFG_DRIVE_MODE5_Msk      (0x700000UL)          /*!< GPIO_PRT CFG: DRIVE_MODE5 (Bitfield-Mask: 0x07)           */
#define GPIO_PRT_CFG_IN_EN5_Pos           (23UL)                /*!< GPIO_PRT CFG: IN_EN5 (Bit 23)                             */
#define GPIO_PRT_CFG_IN_EN5_Msk           (0x800000UL)          /*!< GPIO_PRT CFG: IN_EN5 (Bitfield-Mask: 0x01)                */
#define GPIO_PRT_CFG_DRIVE_MODE6_Pos      (24UL)                /*!< GPIO_PRT CFG: DRIVE_MODE6 (Bit 24)                        */
#define GPIO_PRT_CFG_DRIVE_MODE6_Msk      (0x7000000UL)         /*!< GPIO_PRT CFG: DRIVE_MODE6 (Bitfield-Mask: 0x07)           */
#define GPIO_PRT_CFG_IN_EN6_Pos           (27UL)                /*!< GPIO_PRT CFG: IN_EN6 (Bit 27)                             */
#define GPIO_PRT_CFG_IN_EN6_Msk           (0x8000000UL)         /*!< GPIO_PRT CFG: IN_EN6 (Bitfield-Mask: 0x01)                */
#define GPIO_PRT_CFG_DRIVE_MODE7_Pos      (28UL)                /*!< GPIO_PRT CFG: DRIVE_MODE7 (Bit 28)                        */
#define GPIO_PRT_CFG_DRIVE_MODE7_Msk      (0x70000000UL)        /*!< GPIO_PRT CFG: DRIVE_MODE7 (Bitfield-Mask: 0x07)           */
#define GPIO_PRT_CFG_IN_EN7_Pos           (31UL)                /*!< GPIO_PRT CFG: IN_EN7 (Bit 31)                             */
#define GPIO_PRT_CFG_IN_EN7_Msk           (0x80000000UL)        /*!< GPIO_PRT CFG: IN_EN7 (Bitfield-Mask: 0x01)                */
/* ====================================================  GPIO_PRT.CFG_IN  ==================================================== */
#define GPIO_PRT_CFG_IN_VTRIP_SEL0_0_Pos  (0UL)                 /*!< GPIO_PRT CFG_IN: VTRIP_SEL0_0 (Bit 0)                     */
#define GPIO_PRT_CFG_IN_VTRIP_SEL0_0_Msk  (0x1UL)               /*!< GPIO_PRT CFG_IN: VTRIP_SEL0_0 (Bitfield-Mask: 0x01)       */
#define GPIO_PRT_CFG_IN_VTRIP_SEL1_0_Pos  (1UL)                 /*!< GPIO_PRT CFG_IN: VTRIP_SEL1_0 (Bit 1)                     */
#define GPIO_PRT_CFG_IN_VTRIP_SEL1_0_Msk  (0x2UL)               /*!< GPIO_PRT CFG_IN: VTRIP_SEL1_0 (Bitfield-Mask: 0x01)       */
#define GPIO_PRT_CFG_IN_VTRIP_SEL2_0_Pos  (2UL)                 /*!< GPIO_PRT CFG_IN: VTRIP_SEL2_0 (Bit 2)                     */
#define GPIO_PRT_CFG_IN_VTRIP_SEL2_0_Msk  (0x4UL)               /*!< GPIO_PRT CFG_IN: VTRIP_SEL2_0 (Bitfield-Mask: 0x01)       */
#define GPIO_PRT_CFG_IN_VTRIP_SEL3_0_Pos  (3UL)                 /*!< GPIO_PRT CFG_IN: VTRIP_SEL3_0 (Bit 3)                     */
#define GPIO_PRT_CFG_IN_VTRIP_SEL3_0_Msk  (0x8UL)               /*!< GPIO_PRT CFG_IN: VTRIP_SEL3_0 (Bitfield-Mask: 0x01)       */
#define GPIO_PRT_CFG_IN_VTRIP_SEL4_0_Pos  (4UL)                 /*!< GPIO_PRT CFG_IN: VTRIP_SEL4_0 (Bit 4)                     */
#define GPIO_PRT_CFG_IN_VTRIP_SEL4_0_Msk  (0x10UL)              /*!< GPIO_PRT CFG_IN: VTRIP_SEL4_0 (Bitfield-Mask: 0x01)       */
#define GPIO_PRT_CFG_IN_VTRIP_SEL5_0_Pos  (5UL)                 /*!< GPIO_PRT CFG_IN: VTRIP_SEL5_0 (Bit 5)                     */
#define GPIO_PRT_CFG_IN_VTRIP_SEL5_0_Msk  (0x20UL)              /*!< GPIO_PRT CFG_IN: VTRIP_SEL5_0 (Bitfield-Mask: 0x01)       */
#define GPIO_PRT_CFG_IN_VTRIP_SEL6_0_Pos  (6UL)                 /*!< GPIO_PRT CFG_IN: VTRIP_SEL6_0 (Bit 6)                     */
#define GPIO_PRT_CFG_IN_VTRIP_SEL6_0_Msk  (0x40UL)              /*!< GPIO_PRT CFG_IN: VTRIP_SEL6_0 (Bitfield-Mask: 0x01)       */
#define GPIO_PRT_CFG_IN_VTRIP_SEL7_0_Pos  (7UL)                 /*!< GPIO_PRT CFG_IN: VTRIP_SEL7_0 (Bit 7)                     */
#define GPIO_PRT_CFG_IN_VTRIP_SEL7_0_Msk  (0x80UL)              /*!< GPIO_PRT CFG_IN: VTRIP_SEL7_0 (Bitfield-Mask: 0x01)       */
/* ===================================================  GPIO_PRT.CFG_OUT  ==================================================== */
#define GPIO_PRT_CFG_OUT_SLOW0_Pos        (0UL)                 /*!< GPIO_PRT CFG_OUT: SLOW0 (Bit 0)                           */
#define GPIO_PRT_CFG_OUT_SLOW0_Msk        (0x1UL)               /*!< GPIO_PRT CFG_OUT: SLOW0 (Bitfield-Mask: 0x01)             */
#define GPIO_PRT_CFG_OUT_SLOW1_Pos        (1UL)                 /*!< GPIO_PRT CFG_OUT: SLOW1 (Bit 1)                           */
#define GPIO_PRT_CFG_OUT_SLOW1_Msk        (0x2UL)               /*!< GPIO_PRT CFG_OUT: SLOW1 (Bitfield-Mask: 0x01)             */
#define GPIO_PRT_CFG_OUT_SLOW2_Pos        (2UL)                 /*!< GPIO_PRT CFG_OUT: SLOW2 (Bit 2)                           */
#define GPIO_PRT_CFG_OUT_SLOW2_Msk        (0x4UL)               /*!< GPIO_PRT CFG_OUT: SLOW2 (Bitfield-Mask: 0x01)             */
#define GPIO_PRT_CFG_OUT_SLOW3_Pos        (3UL)                 /*!< GPIO_PRT CFG_OUT: SLOW3 (Bit 3)                           */
#define GPIO_PRT_CFG_OUT_SLOW3_Msk        (0x8UL)               /*!< GPIO_PRT CFG_OUT: SLOW3 (Bitfield-Mask: 0x01)             */
#define GPIO_PRT_CFG_OUT_SLOW4_Pos        (4UL)                 /*!< GPIO_PRT CFG_OUT: SLOW4 (Bit 4)                           */
#define GPIO_PRT_CFG_OUT_SLOW4_Msk        (0x10UL)              /*!< GPIO_PRT CFG_OUT: SLOW4 (Bitfield-Mask: 0x01)             */
#define GPIO_PRT_CFG_OUT_SLOW5_Pos        (5UL)                 /*!< GPIO_PRT CFG_OUT: SLOW5 (Bit 5)                           */
#define GPIO_PRT_CFG_OUT_SLOW5_Msk        (0x20UL)              /*!< GPIO_PRT CFG_OUT: SLOW5 (Bitfield-Mask: 0x01)             */
#define GPIO_PRT_CFG_OUT_SLOW6_Pos        (6UL)                 /*!< GPIO_PRT CFG_OUT: SLOW6 (Bit 6)                           */
#define GPIO_PRT_CFG_OUT_SLOW6_Msk        (0x40UL)              /*!< GPIO_PRT CFG_OUT: SLOW6 (Bitfield-Mask: 0x01)             */
#define GPIO_PRT_CFG_OUT_SLOW7_Pos        (7UL)                 /*!< GPIO_PRT CFG_OUT: SLOW7 (Bit 7)                           */
#define GPIO_PRT_CFG_OUT_SLOW7_Msk        (0x80UL)              /*!< GPIO_PRT CFG_OUT: SLOW7 (Bitfield-Mask: 0x01)             */
#define GPIO_PRT_CFG_OUT_DRIVE_SEL0_Pos   (16UL)                /*!< GPIO_PRT CFG_OUT: DRIVE_SEL0 (Bit 16)                     */
#define GPIO_PRT_CFG_OUT_DRIVE_SEL0_Msk   (0x30000UL)           /*!< GPIO_PRT CFG_OUT: DRIVE_SEL0 (Bitfield-Mask: 0x03)        */
#define GPIO_PRT_CFG_OUT_DRIVE_SEL1_Pos   (18UL)                /*!< GPIO_PRT CFG_OUT: DRIVE_SEL1 (Bit 18)                     */
#define GPIO_PRT_CFG_OUT_DRIVE_SEL1_Msk   (0xc0000UL)           /*!< GPIO_PRT CFG_OUT: DRIVE_SEL1 (Bitfield-Mask: 0x03)        */
#define GPIO_PRT_CFG_OUT_DRIVE_SEL2_Pos   (20UL)                /*!< GPIO_PRT CFG_OUT: DRIVE_SEL2 (Bit 20)                     */
#define GPIO_PRT_CFG_OUT_DRIVE_SEL2_Msk   (0x300000UL)          /*!< GPIO_PRT CFG_OUT: DRIVE_SEL2 (Bitfield-Mask: 0x03)        */
#define GPIO_PRT_CFG_OUT_DRIVE_SEL3_Pos   (22UL)                /*!< GPIO_PRT CFG_OUT: DRIVE_SEL3 (Bit 22)                     */
#define GPIO_PRT_CFG_OUT_DRIVE_SEL3_Msk   (0xc00000UL)          /*!< GPIO_PRT CFG_OUT: DRIVE_SEL3 (Bitfield-Mask: 0x03)        */
#define GPIO_PRT_CFG_OUT_DRIVE_SEL4_Pos   (24UL)                /*!< GPIO_PRT CFG_OUT: DRIVE_SEL4 (Bit 24)                     */
#define GPIO_PRT_CFG_OUT_DRIVE_SEL4_Msk   (0x3000000UL)         /*!< GPIO_PRT CFG_OUT: DRIVE_SEL4 (Bitfield-Mask: 0x03)        */
#define GPIO_PRT_CFG_OUT_DRIVE_SEL5_Pos   (26UL)                /*!< GPIO_PRT CFG_OUT: DRIVE_SEL5 (Bit 26)                     */
#define GPIO_PRT_CFG_OUT_DRIVE_SEL5_Msk   (0xc000000UL)         /*!< GPIO_PRT CFG_OUT: DRIVE_SEL5 (Bitfield-Mask: 0x03)        */
#define GPIO_PRT_CFG_OUT_DRIVE_SEL6_Pos   (28UL)                /*!< GPIO_PRT CFG_OUT: DRIVE_SEL6 (Bit 28)                     */
#define GPIO_PRT_CFG_OUT_DRIVE_SEL6_Msk   (0x30000000UL)        /*!< GPIO_PRT CFG_OUT: DRIVE_SEL6 (Bitfield-Mask: 0x03)        */
#define GPIO_PRT_CFG_OUT_DRIVE_SEL7_Pos   (30UL)                /*!< GPIO_PRT CFG_OUT: DRIVE_SEL7 (Bit 30)                     */
#define GPIO_PRT_CFG_OUT_DRIVE_SEL7_Msk   (0xc0000000UL)        /*!< GPIO_PRT CFG_OUT: DRIVE_SEL7 (Bitfield-Mask: 0x03)        */
/* ===================================================  GPIO_PRT.CFG_SIO  ==================================================== */
#define GPIO_PRT_CFG_SIO_VREG_EN01_Pos    (0UL)                 /*!< GPIO_PRT CFG_SIO: VREG_EN01 (Bit 0)                       */
#define GPIO_PRT_CFG_SIO_VREG_EN01_Msk    (0x1UL)               /*!< GPIO_PRT CFG_SIO: VREG_EN01 (Bitfield-Mask: 0x01)         */
#define GPIO_PRT_CFG_SIO_IBUF_SEL01_Pos   (1UL)                 /*!< GPIO_PRT CFG_SIO: IBUF_SEL01 (Bit 1)                      */
#define GPIO_PRT_CFG_SIO_IBUF_SEL01_Msk   (0x2UL)               /*!< GPIO_PRT CFG_SIO: IBUF_SEL01 (Bitfield-Mask: 0x01)        */
#define GPIO_PRT_CFG_SIO_VTRIP_SEL01_Pos  (2UL)                 /*!< GPIO_PRT CFG_SIO: VTRIP_SEL01 (Bit 2)                     */
#define GPIO_PRT_CFG_SIO_VTRIP_SEL01_Msk  (0x4UL)               /*!< GPIO_PRT CFG_SIO: VTRIP_SEL01 (Bitfield-Mask: 0x01)       */
#define GPIO_PRT_CFG_SIO_VREF_SEL01_Pos   (3UL)                 /*!< GPIO_PRT CFG_SIO: VREF_SEL01 (Bit 3)                      */
#define GPIO_PRT_CFG_SIO_VREF_SEL01_Msk   (0x18UL)              /*!< GPIO_PRT CFG_SIO: VREF_SEL01 (Bitfield-Mask: 0x03)        */
#define GPIO_PRT_CFG_SIO_VOH_SEL01_Pos    (5UL)                 /*!< GPIO_PRT CFG_SIO: VOH_SEL01 (Bit 5)                       */
#define GPIO_PRT_CFG_SIO_VOH_SEL01_Msk    (0xe0UL)              /*!< GPIO_PRT CFG_SIO: VOH_SEL01 (Bitfield-Mask: 0x07)         */
#define GPIO_PRT_CFG_SIO_VREG_EN23_Pos    (8UL)                 /*!< GPIO_PRT CFG_SIO: VREG_EN23 (Bit 8)                       */
#define GPIO_PRT_CFG_SIO_VREG_EN23_Msk    (0x100UL)             /*!< GPIO_PRT CFG_SIO: VREG_EN23 (Bitfield-Mask: 0x01)         */
#define GPIO_PRT_CFG_SIO_IBUF_SEL23_Pos   (9UL)                 /*!< GPIO_PRT CFG_SIO: IBUF_SEL23 (Bit 9)                      */
#define GPIO_PRT_CFG_SIO_IBUF_SEL23_Msk   (0x200UL)             /*!< GPIO_PRT CFG_SIO: IBUF_SEL23 (Bitfield-Mask: 0x01)        */
#define GPIO_PRT_CFG_SIO_VTRIP_SEL23_Pos  (10UL)                /*!< GPIO_PRT CFG_SIO: VTRIP_SEL23 (Bit 10)                    */
#define GPIO_PRT_CFG_SIO_VTRIP_SEL23_Msk  (0x400UL)             /*!< GPIO_PRT CFG_SIO: VTRIP_SEL23 (Bitfield-Mask: 0x01)       */
#define GPIO_PRT_CFG_SIO_VREF_SEL23_Pos   (11UL)                /*!< GPIO_PRT CFG_SIO: VREF_SEL23 (Bit 11)                     */
#define GPIO_PRT_CFG_SIO_VREF_SEL23_Msk   (0x1800UL)            /*!< GPIO_PRT CFG_SIO: VREF_SEL23 (Bitfield-Mask: 0x03)        */
#define GPIO_PRT_CFG_SIO_VOH_SEL23_Pos    (13UL)                /*!< GPIO_PRT CFG_SIO: VOH_SEL23 (Bit 13)                      */
#define GPIO_PRT_CFG_SIO_VOH_SEL23_Msk    (0xe000UL)            /*!< GPIO_PRT CFG_SIO: VOH_SEL23 (Bitfield-Mask: 0x07)         */
#define GPIO_PRT_CFG_SIO_VREG_EN45_Pos    (16UL)                /*!< GPIO_PRT CFG_SIO: VREG_EN45 (Bit 16)                      */
#define GPIO_PRT_CFG_SIO_VREG_EN45_Msk    (0x10000UL)           /*!< GPIO_PRT CFG_SIO: VREG_EN45 (Bitfield-Mask: 0x01)         */
#define GPIO_PRT_CFG_SIO_IBUF_SEL45_Pos   (17UL)                /*!< GPIO_PRT CFG_SIO: IBUF_SEL45 (Bit 17)                     */
#define GPIO_PRT_CFG_SIO_IBUF_SEL45_Msk   (0x20000UL)           /*!< GPIO_PRT CFG_SIO: IBUF_SEL45 (Bitfield-Mask: 0x01)        */
#define GPIO_PRT_CFG_SIO_VTRIP_SEL45_Pos  (18UL)                /*!< GPIO_PRT CFG_SIO: VTRIP_SEL45 (Bit 18)                    */
#define GPIO_PRT_CFG_SIO_VTRIP_SEL45_Msk  (0x40000UL)           /*!< GPIO_PRT CFG_SIO: VTRIP_SEL45 (Bitfield-Mask: 0x01)       */
#define GPIO_PRT_CFG_SIO_VREF_SEL45_Pos   (19UL)                /*!< GPIO_PRT CFG_SIO: VREF_SEL45 (Bit 19)                     */
#define GPIO_PRT_CFG_SIO_VREF_SEL45_Msk   (0x180000UL)          /*!< GPIO_PRT CFG_SIO: VREF_SEL45 (Bitfield-Mask: 0x03)        */
#define GPIO_PRT_CFG_SIO_VOH_SEL45_Pos    (21UL)                /*!< GPIO_PRT CFG_SIO: VOH_SEL45 (Bit 21)                      */
#define GPIO_PRT_CFG_SIO_VOH_SEL45_Msk    (0xe00000UL)          /*!< GPIO_PRT CFG_SIO: VOH_SEL45 (Bitfield-Mask: 0x07)         */
#define GPIO_PRT_CFG_SIO_VREG_EN67_Pos    (24UL)                /*!< GPIO_PRT CFG_SIO: VREG_EN67 (Bit 24)                      */
#define GPIO_PRT_CFG_SIO_VREG_EN67_Msk    (0x1000000UL)         /*!< GPIO_PRT CFG_SIO: VREG_EN67 (Bitfield-Mask: 0x01)         */
#define GPIO_PRT_CFG_SIO_IBUF_SEL67_Pos   (25UL)                /*!< GPIO_PRT CFG_SIO: IBUF_SEL67 (Bit 25)                     */
#define GPIO_PRT_CFG_SIO_IBUF_SEL67_Msk   (0x2000000UL)         /*!< GPIO_PRT CFG_SIO: IBUF_SEL67 (Bitfield-Mask: 0x01)        */
#define GPIO_PRT_CFG_SIO_VTRIP_SEL67_Pos  (26UL)                /*!< GPIO_PRT CFG_SIO: VTRIP_SEL67 (Bit 26)                    */
#define GPIO_PRT_CFG_SIO_VTRIP_SEL67_Msk  (0x4000000UL)         /*!< GPIO_PRT CFG_SIO: VTRIP_SEL67 (Bitfield-Mask: 0x01)       */
#define GPIO_PRT_CFG_SIO_VREF_SEL67_Pos   (27UL)                /*!< GPIO_PRT CFG_SIO: VREF_SEL67 (Bit 27)                     */
#define GPIO_PRT_CFG_SIO_VREF_SEL67_Msk   (0x18000000UL)        /*!< GPIO_PRT CFG_SIO: VREF_SEL67 (Bitfield-Mask: 0x03)        */
#define GPIO_PRT_CFG_SIO_VOH_SEL67_Pos    (29UL)                /*!< GPIO_PRT CFG_SIO: VOH_SEL67 (Bit 29)                      */
#define GPIO_PRT_CFG_SIO_VOH_SEL67_Msk    (0xe0000000UL)        /*!< GPIO_PRT CFG_SIO: VOH_SEL67 (Bitfield-Mask: 0x07)         */
/* ================================================  GPIO_PRT.CFG_IN_GPIO5V  ================================================= */
#define GPIO_PRT_CFG_IN_GPIO5V_VTRIP_SEL0_1_Pos (0UL)           /*!< GPIO_PRT CFG_IN_GPIO5V: VTRIP_SEL0_1 (Bit 0)              */
#define GPIO_PRT_CFG_IN_GPIO5V_VTRIP_SEL0_1_Msk (0x1UL)         /*!< GPIO_PRT CFG_IN_GPIO5V: VTRIP_SEL0_1 (Bitfield-Mask: 0x01)*/
