ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6_CY8C/device/ip/cyip_gpio.h
#define GPIO_PRT_CFG_IN_GPIO5V_VTRIP_SEL1_1_Pos (1UL)           /*!< GPIO_PRT CFG_IN_GPIO5V: VTRIP_SEL1_1 (Bit 1)              */
#define GPIO_PRT_CFG_IN_GPIO5V_VTRIP_SEL1_1_Msk (0x2UL)         /*!< GPIO_PRT CFG_IN_GPIO5V: VTRIP_SEL1_1 (Bitfield-Mask: 0x01)*/
#define GPIO_PRT_CFG_IN_GPIO5V_VTRIP_SEL2_1_Pos (2UL)           /*!< GPIO_PRT CFG_IN_GPIO5V: VTRIP_SEL2_1 (Bit 2)              */
#define GPIO_PRT_CFG_IN_GPIO5V_VTRIP_SEL2_1_Msk (0x4UL)         /*!< GPIO_PRT CFG_IN_GPIO5V: VTRIP_SEL2_1 (Bitfield-Mask: 0x01)*/
#define GPIO_PRT_CFG_IN_GPIO5V_VTRIP_SEL3_1_Pos (3UL)           /*!< GPIO_PRT CFG_IN_GPIO5V: VTRIP_SEL3_1 (Bit 3)              */
#define GPIO_PRT_CFG_IN_GPIO5V_VTRIP_SEL3_1_Msk (0x8UL)         /*!< GPIO_PRT CFG_IN_GPIO5V: VTRIP_SEL3_1 (Bitfield-Mask: 0x01)*/
#define GPIO_PRT_CFG_IN_GPIO5V_VTRIP_SEL4_1_Pos (4UL)           /*!< GPIO_PRT CFG_IN_GPIO5V: VTRIP_SEL4_1 (Bit 4)              */
#define GPIO_PRT_CFG_IN_GPIO5V_VTRIP_SEL4_1_Msk (0x10UL)        /*!< GPIO_PRT CFG_IN_GPIO5V: VTRIP_SEL4_1 (Bitfield-Mask: 0x01)*/
#define GPIO_PRT_CFG_IN_GPIO5V_VTRIP_SEL5_1_Pos (5UL)           /*!< GPIO_PRT CFG_IN_GPIO5V: VTRIP_SEL5_1 (Bit 5)              */
#define GPIO_PRT_CFG_IN_GPIO5V_VTRIP_SEL5_1_Msk (0x20UL)        /*!< GPIO_PRT CFG_IN_GPIO5V: VTRIP_SEL5_1 (Bitfield-Mask: 0x01)*/
#define GPIO_PRT_CFG_IN_GPIO5V_VTRIP_SEL6_1_Pos (6UL)           /*!< GPIO_PRT CFG_IN_GPIO5V: VTRIP_SEL6_1 (Bit 6)              */
#define GPIO_PRT_CFG_IN_GPIO5V_VTRIP_SEL6_1_Msk (0x40UL)        /*!< GPIO_PRT CFG_IN_GPIO5V: VTRIP_SEL6_1 (Bitfield-Mask: 0x01)*/
#define GPIO_PRT_CFG_IN_GPIO5V_VTRIP_SEL7_1_Pos (7UL)           /*!< GPIO_PRT CFG_IN_GPIO5V: VTRIP_SEL7_1 (Bit 7)              */
#define GPIO_PRT_CFG_IN_GPIO5V_VTRIP_SEL7_1_Msk (0x80UL)        /*!< GPIO_PRT CFG_IN_GPIO5V: VTRIP_SEL7_1 (Bitfield-Mask: 0x01)*/


/* ===================================================  GPIO.INTR_CAUSE0  ==================================================== */
#define GPIO_INTR_CAUSE0_PORT_INT_Pos     (0UL)                 /*!< GPIO INTR_CAUSE0: PORT_INT (Bit 0)                        */
#define GPIO_INTR_CAUSE0_PORT_INT_Msk     (0xffffffffUL)        /*!< GPIO INTR_CAUSE0: PORT_INT (Bitfield-Mask: 0xffffffff)    */
/* ===================================================  GPIO.INTR_CAUSE1  ==================================================== */
#define GPIO_INTR_CAUSE1_PORT_INT_Pos     (0UL)                 /*!< GPIO INTR_CAUSE1: PORT_INT (Bit 0)                        */
#define GPIO_INTR_CAUSE1_PORT_INT_Msk     (0xffffffffUL)        /*!< GPIO INTR_CAUSE1: PORT_INT (Bitfield-Mask: 0xffffffff)    */
/* ===================================================  GPIO.INTR_CAUSE2  ==================================================== */
#define GPIO_INTR_CAUSE2_PORT_INT_Pos     (0UL)                 /*!< GPIO INTR_CAUSE2: PORT_INT (Bit 0)                        */
#define GPIO_INTR_CAUSE2_PORT_INT_Msk     (0xffffffffUL)        /*!< GPIO INTR_CAUSE2: PORT_INT (Bitfield-Mask: 0xffffffff)    */
/* ===================================================  GPIO.INTR_CAUSE3  ==================================================== */
#define GPIO_INTR_CAUSE3_PORT_INT_Pos     (0UL)                 /*!< GPIO INTR_CAUSE3: PORT_INT (Bit 0)                        */
#define GPIO_INTR_CAUSE3_PORT_INT_Msk     (0xffffffffUL)        /*!< GPIO INTR_CAUSE3: PORT_INT (Bitfield-Mask: 0xffffffff)    */
/* ====================================================  GPIO.VDD_ACTIVE  ==================================================== */
#define GPIO_VDD_ACTIVE_VDDIO_ACTIVE_Pos  (0UL)                 /*!< GPIO VDD_ACTIVE: VDDIO_ACTIVE (Bit 0)                     */
#define GPIO_VDD_ACTIVE_VDDIO_ACTIVE_Msk  (0xffffUL)            /*!< GPIO VDD_ACTIVE: VDDIO_ACTIVE (Bitfield-Mask: 0xffff)     */
#define GPIO_VDD_ACTIVE_VDDA_ACTIVE_Pos   (30UL)                /*!< GPIO VDD_ACTIVE: VDDA_ACTIVE (Bit 30)                     */
#define GPIO_VDD_ACTIVE_VDDA_ACTIVE_Msk   (0x40000000UL)        /*!< GPIO VDD_ACTIVE: VDDA_ACTIVE (Bitfield-Mask: 0x01)        */
#define GPIO_VDD_ACTIVE_VDDD_ACTIVE_Pos   (31UL)                /*!< GPIO VDD_ACTIVE: VDDD_ACTIVE (Bit 31)                     */
#define GPIO_VDD_ACTIVE_VDDD_ACTIVE_Msk   (0x80000000UL)        /*!< GPIO VDD_ACTIVE: VDDD_ACTIVE (Bitfield-Mask: 0x01)        */
/* =====================================================  GPIO.VDD_INTR  ===================================================== */
#define GPIO_VDD_INTR_VDDIO_ACTIVE_Pos    (0UL)                 /*!< GPIO VDD_INTR: VDDIO_ACTIVE (Bit 0)                       */
#define GPIO_VDD_INTR_VDDIO_ACTIVE_Msk    (0xffffUL)            /*!< GPIO VDD_INTR: VDDIO_ACTIVE (Bitfield-Mask: 0xffff)       */
#define GPIO_VDD_INTR_VDDA_ACTIVE_Pos     (30UL)                /*!< GPIO VDD_INTR: VDDA_ACTIVE (Bit 30)                       */
#define GPIO_VDD_INTR_VDDA_ACTIVE_Msk     (0x40000000UL)        /*!< GPIO VDD_INTR: VDDA_ACTIVE (Bitfield-Mask: 0x01)          */
#define GPIO_VDD_INTR_VDDD_ACTIVE_Pos     (31UL)                /*!< GPIO VDD_INTR: VDDD_ACTIVE (Bit 31)                       */
#define GPIO_VDD_INTR_VDDD_ACTIVE_Msk     (0x80000000UL)        /*!< GPIO VDD_INTR: VDDD_ACTIVE (Bitfield-Mask: 0x01)          */
/* ==================================================  GPIO.VDD_INTR_MASK  =================================================== */
#define GPIO_VDD_INTR_MASK_VDDIO_ACTIVE_Pos (0UL)               /*!< GPIO VDD_INTR_MASK: VDDIO_ACTIVE (Bit 0)                  */
#define GPIO_VDD_INTR_MASK_VDDIO_ACTIVE_Msk (0xffffUL)          /*!< GPIO VDD_INTR_MASK: VDDIO_ACTIVE (Bitfield-Mask: 0xffff)  */
#define GPIO_VDD_INTR_MASK_VDDA_ACTIVE_Pos (30UL)               /*!< GPIO VDD_INTR_MASK: VDDA_ACTIVE (Bit 30)                  */
#define GPIO_VDD_INTR_MASK_VDDA_ACTIVE_Msk (0x40000000UL)       /*!< GPIO VDD_INTR_MASK: VDDA_ACTIVE (Bitfield-Mask: 0x01)     */
#define GPIO_VDD_INTR_MASK_VDDD_ACTIVE_Pos (31UL)               /*!< GPIO VDD_INTR_MASK: VDDD_ACTIVE (Bit 31)                  */
#define GPIO_VDD_INTR_MASK_VDDD_ACTIVE_Msk (0x80000000UL)       /*!< GPIO VDD_INTR_MASK: VDDD_ACTIVE (Bitfield-Mask: 0x01)     */
/* =================================================  GPIO.VDD_INTR_MASKED  ================================================== */
#define GPIO_VDD_INTR_MASKED_VDDIO_ACTIVE_Pos (0UL)             /*!< GPIO VDD_INTR_MASKED: VDDIO_ACTIVE (Bit 0)                */
#define GPIO_VDD_INTR_MASKED_VDDIO_ACTIVE_Msk (0xffffUL)        /*!< GPIO VDD_INTR_MASKED: VDDIO_ACTIVE (Bitfield-Mask: 0xffff)*/
#define GPIO_VDD_INTR_MASKED_VDDA_ACTIVE_Pos (30UL)             /*!< GPIO VDD_INTR_MASKED: VDDA_ACTIVE (Bit 30)                */
#define GPIO_VDD_INTR_MASKED_VDDA_ACTIVE_Msk (0x40000000UL)     /*!< GPIO VDD_INTR_MASKED: VDDA_ACTIVE (Bitfield-Mask: 0x01)   */
#define GPIO_VDD_INTR_MASKED_VDDD_ACTIVE_Pos (31UL)             /*!< GPIO VDD_INTR_MASKED: VDDD_ACTIVE (Bit 31)                */
#define GPIO_VDD_INTR_MASKED_VDDD_ACTIVE_Msk (0x80000000UL)     /*!< GPIO VDD_INTR_MASKED: VDDD_ACTIVE (Bitfield-Mask: 0x01)   */
/* ===================================================  GPIO.VDD_INTR_SET  =================================================== */
#define GPIO_VDD_INTR_SET_VDDIO_ACTIVE_Pos (0UL)                /*!< GPIO VDD_INTR_SET: VDDIO_ACTIVE (Bit 0)                   */
#define GPIO_VDD_INTR_SET_VDDIO_ACTIVE_Msk (0xffffUL)           /*!< GPIO VDD_INTR_SET: VDDIO_ACTIVE (Bitfield-Mask: 0xffff)   */
#define GPIO_VDD_INTR_SET_VDDA_ACTIVE_Pos (30UL)                /*!< GPIO VDD_INTR_SET: VDDA_ACTIVE (Bit 30)                   */
#define GPIO_VDD_INTR_SET_VDDA_ACTIVE_Msk (0x40000000UL)        /*!< GPIO VDD_INTR_SET: VDDA_ACTIVE (Bitfield-Mask: 0x01)      */
#define GPIO_VDD_INTR_SET_VDDD_ACTIVE_Pos (31UL)                /*!< GPIO VDD_INTR_SET: VDDD_ACTIVE (Bit 31)                   */
#define GPIO_VDD_INTR_SET_VDDD_ACTIVE_Msk (0x80000000UL)        /*!< GPIO VDD_INTR_SET: VDDD_ACTIVE (Bitfield-Mask: 0x01)      */


#endif /* _CYIP_GPIO_H_ */


/* [] END OF FILE */
